import time

import requests
import wget
import os

from fake_useragent import UserAgent

UA = UserAgent()

ids = [38578, 55230, 27345, 23864, 17107, 23882, 17057, 27339, 38584, 23805, 17780, 25334, 25383, 26667, 24413, 19199,
       55238, 17237, 19445, 23855, 19192, 55191, 19345, 17788, 23632, 19440, 17069, 23825, 19208, 23622, 17768, 23886,
       19425, 17796, 19420, 17078, 19308, 19648, 38603, 19213, 17089, 23837, 25353, 19203, 17988, 25881, 34833, 19361,
       25379, 23912, 19259, 17159, 19405, 26707, 28277, 19430, 24280, 19323, 17111, 19313, 17126, 19389, 19356, 23894,
       25343, 19351, 19292, 26736, 23987, 17065, 23982, 34841, 18030, 25348, 17051, 23627, 25877, 34837, 23832, 23616,
       23674, 23771, 17252, 19303, 23904, 19623, 23655, 25358, 55219, 19475, 26689, 28224, 19368, 19644, 19378, 19233,
       23900, 26731, 18974, 19612, 25404, 26677, 17135, 17242, 28230, 25411, 17044, 16921, 19681, 26723, 17121, 17247,
       19415, 17802, 19587, 23789, 26703, 23661, 25398, 23641, 26741, 19470, 21624, 26784, 19238, 25389, 25330, 26727,
       23794, 19490, 28243, 19629, 19485, 17139, 18925, 19660, 19638, 19284, 23637, 26792, 19248, 19692, 19328, 19334,
       19665, 25394, 17084, 16916, 26753, 26659, 28252, 21619, 19223, 19394, 55206, 17149, 55215, 26672, 26764, 55224,
       17218, 26780, 19228, 19495, 26788, 23646, 26749, 28220, 23784, 19618, 23799, 26694, 55200, 19218, 55211, 19298,
       19675, 19253, 21614, 26663, 19480, 17144, 28235, 23668, 26758, 19697, 26717, 17131, 19451, 19458, 28270, 28215,
       17098, 28239, 19435, 19279, 26711, 17232, 17033, 19384, 28265, 26684, 19463, 19500, 26745, 16923, 17208, 17213,
       19264, 17007, 19582, 26699, 25339, 19269, 28248, 19274, 19655, 26775, 19670, 19243, 19634, 17102, 19373, 26768,
       18934, 17224, 19505, 19318, 19410, 17153, 19687]

all_url_to_download = []


def retry(func):
    def _wrapper(*args, **kwargs):
        try:
            func(*args, **kwargs)
        except:
            time.sleep(1)
            func(*args, **kwargs)
    return _wrapper


def main():
    global path_name
    limit = int(input('сколько открыток надо скачать от 1 до 230: '))
    name = input('введите имя кого вы хотите поздравить: ')
    path_name = f'{name}_{limit}'
    if not os.path.exists(path_name):
        os.mkdir(f'{name}_{limit}')
    while limit > 0:
        print(limit, name)
        send_req(name=name, const_id=ids[limit])
        limit = limit - 1
    save()


@retry
def save():
    for name, url in enumerate(all_url_to_download):
        if url.split('.')[2] == 'jpg':
            wget.download(url, f'{path_name}/{name}.jpg',)
        else:
            wget.download(url, f'{path_name}/{name}.gif')
        time.sleep(0.5)


@retry
def send_req(name: str, const_id: int):
    req = requests.post(url='https://srozhdeniem.ru/wp-admin/admin-ajax.php',
                        headers={
                            'User-Agent': UA.random},
                        data={
                            'action': 'imgconst2_gen',
                            'user_name': name,
                            'const_id': f'{const_id}'})  # сюда потом id
    time.sleep(1)
    all_url_to_download.append(req.text)


if __name__ == '__main__':
    main()
